Sources/interTwoPhaseCentralFoam/tutorial/WaterGas/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e+5;

boundaryField
{
    sides
    {
        type            zeroGradient;
    }
    "(empty1|empty2)"
    {
        type            empty;
    }


//    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
