Sources/interTwoPhaseCentralFoam/tutorial/WaterGas/constant/reactions
species
(
    gas
);

reactions
{
}
